servicemix-osgi/proxy/result.txt
christian-muellers-macbook-pro:proxy cmueller$ ab -n 10000 -c 20 -p 1K_buyStocks.xml -T text/xml http://localhost:8192/service/DirectProxy
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        Jetty(7.5.4.v20111024)
Server Hostname:        localhost
Server Port:            8192

Document Path:          /service/DirectProxy
Document Length:        1286 bytes

Concurrency Level:      20
Time taken for tests:   1.681 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Non-2xx responses:      10000
Total transferred:      14600000 bytes
Total POSTed:           11736408
HTML transferred:       12860000 bytes
Requests per second:    5947.61 [#/sec] (mean)
Time per request:       3.363 [ms] (mean)
Time per request:       0.168 [ms] (mean, across all concurrent requests)
Transfer rate:          8479.99 [Kbytes/sec] received
                        6816.75 kb/s sent
                        15296.74 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.3      1      52
Processing:     0    2   3.5      2      53
Waiting:        0    2   3.2      2      53
Total:          1    3   3.7      3      54

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      3
  80%      3
  90%      4
  95%      5
  98%      7
  99%     10
 100%     54 (longest request)