servicemix-osgi/proxy/result.txt
christian-muellers-macbook-pro:servicemix-osgi cmueller$ ab -n 10000 -c 20 -p 1K_buyStocks.xml -T text/xml http://localhost:8192/service/DirectProxy
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        Apache-Coyote/1.1
Server Hostname:        localhost
Server Port:            8192

Document Path:          /service/DirectProxy
Document Length:        1024 bytes

Concurrency Level:      20
Time taken for tests:   4.837 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      12999093 bytes
Total POSTed:           11729376
HTML transferred:       10247168 bytes
Requests per second:    2067.29 [#/sec] (mean)
Time per request:       9.675 [ms] (mean)
Time per request:       0.484 [ms] (mean, across all concurrent requests)
Transfer rate:          2624.30 [Kbytes/sec] received
                        2367.97 kb/s sent
                        4992.27 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.7      1      18
Processing:     1    8   2.6      8      26
Waiting:        0    7   2.6      7      25
Total:          2   10   2.5      9      29

Percentage of the requests served within a certain time (ms)
  50%      9
  66%      9
  75%     10
  80%     10
  90%     12
  95%     15
  98%     20
  99%     20
 100%     29 (longest request)